# Основные вопросы
MSG_LOAD_QUESTION = "Вы загрузились и получили документы?"
MSG_DOC_CHECK_QUESTION = "Не забывай, что на СМР должны быть дата и подпись. Все верно?"
MSG_DOC_INVALID_WARNING = "️ Просим проверить наличие даты и печати. Пришлите фото с печатью, подписью и датой."

# Уведомления
MSG_DOCS_SENT = "✅ Спасибо! Документы отправлены логисту."
MSG_WAITING_FILES = "Сделайте фото и пришлите акты, СМРки и пробег.\nКогда закончите - нажмите кнопку «Готово»."
MSG_WAITING_REASON = "Укажите причину:"
MSG_WAITING_DELAY = "Через сколько вы загрузитесь?\nУкажите время, например: 20 или 1 час 20 минут."

# Напоминания
MSG_REMINDER = "⏰ Напоминание: Вы загрузились и получили документы?\nЕсли да - пришлите документы."

# Помощь
HELP_TEXT = (
    "📋 Команды логиста:\n\n"
    "/route выезд-выгрузка:время:машина:маршрут:смещение - рейс\n"
    "Пример: /route 20.08-24.08:16:00:M772OP21:Ташкент-Пермь:+2\n"
    "/routes - список рейсов\n"
    "/delroute НОМЕР - удалить рейс\n\n"
    "/broadcast ЧЧ:ММ текст - единоразово во все группы\n"
    "/broadcast ежедневно ЧЧ:ММ текст - ежедневно во все\n"
    "/broadcast ежедневно ЧЧ:ММ группа текст - ежедневно в группу\n"
    "/deltask НОМЕР - удалить задачу рассылки\n\n"
    "/driver МАШИНА @user - назначить водителя\n"
    "/groups - список групп\n"
    "/who - выбор роли в группе\n"
    "/ask - задать вопрос водителю вручную\n"
    "/tasks - список отложенных задач"
)

ROUTE_HELP = (
    "🛣️Маршрут:\n\n"
    "/route выезд-выгрузка:время:машина:маршрут:смещение - рейс\n"
    "Пример: /route 20.08-24.08:16:00:M772OP21:Ташкент-Пермь:+2\n"
    "/routes - список рейсов\n"
    "/delroute НОМЕР - удалить рейс"
)

BROADCAST = (
    "💭 Автосообщения:\n\n"
    "/broadcast ЧЧ:ММ текст - единоразово во все группы\n"
    "/broadcast ежедневно ЧЧ:ММ текст - ежедневно во все группы\n"
    "/broadcast ежедневно ЧЧ:ММ группа текст - ежедневно в группу\n"
    "/tasks - все запланированные задачи\n"
    "/deltask НОМЕР - удалить задачу\n\n"
    " Примеры:\n"
    "/broadcast ежедневно 8:00 текст\n"
    "/broadcast ежедневно 08:00 M772OP21 текст\n"
    "/broadcast ежедневно 08:00 M772OP21 Кондратьев текст\n"
    "/broadcast 08:00 текст\n"
)